In [1]:
import pandas as pd
import seaborn as sns

In [2]:
input_folder = "../clean_data/"
output_folder = "../final_data/"

In [3]:
books = pd.read_csv(input_folder + "fiction_books.csv")
authors = pd.read_csv(input_folder + "authors.csv")
ratings = pd.read_csv(input_folder + "ratings.csv")
users = pd.read_csv(input_folder + "users.csv")

In [4]:
books.shape

(1160, 58)

In [5]:
print("Authors columns: ", authors.columns)
print("Books columns: ", books.columns)
print("Ratings columns: ", ratings.columns)
print("Users columns: ", users.columns)

Authors columns:  Index(['Name', 'Birth Year', 'Genres', 'Books'], dtype='object')
Books columns:  Index(['Book Title', 'Author', 'Publication Year', 'Genres', 'Summary',
       'Rating Count', 'Average Rating', 'Number of Pages', 'Best Seller',
       'Film', 'Saga', 'Followed by', 'Preceded by', 'speculative', 'science',
       'fantasy', 'childrens', 'mystery', 'suspense', 'crime', 'thriller',
       'historical', 'young adult', 'horror', 'romance', 'detective',
       'adventure', 'spy', 'alternate', 'satire', 'gothic', 'techno', 'war',
       'sword', 'humour', 'sorcery', 'dystopia', 'utopian', 'high',
       'picture book', 'western', 'military', 'black', 'time travel',
       'apocalyptic', 'hard', 'magic', 'realism', 'steampunk', 'literary',
       'epistolary', 'drama', 'erotic', 'vampire', 'cyberpunk', 'true', 'epic',
       'comedy'],
      dtype='object')
Ratings columns:  Index(['User-ID', 'Book-Rating', 'Book Title'], dtype='object')
Users columns:  Index(['User-ID', 'Location', 'Age', 'Rating Count', 'Average Rating',
       'Country'],
      dtype='object')

# Remove ratings that don't have book

In [6]:
ratings[ratings['Book Title'].isin(books['Book Title'])]

       User-ID  Book-Rating                     Book Title
11      277427            9                 Oryx and Crake
14      277427            7                    The Partner
21      277427            8                 The Snow Queen
24      277427           10                  Doomsday Book
26      277427            9  A Monstrous Regiment of Women
...        ...          ...                            ...
29809   276641            8                  The Treatment
29811   276670            7               The Road to Mars
29823   276680            8                 Oryx and Crake
29831   276680            9                  A Simple Plan
29834   276680           10                       Affinity

[8493 rows x 3 columns]

# Rating Count & Average Rating

In [7]:
use = False

In [8]:
users.drop(columns=['Rating Count', 'Average Rating'], inplace=True)

if use:
    user_ratings_count = ratings.groupby('User-ID').size().reset_index(name='Rating Count')

    user_avg_rating = ratings.groupby('User-ID')['Book-Rating'].mean()

    users = pd.merge(users, user_ratings_count, on='User-ID', how='left')
    users = pd.merge(users, user_avg_rating, on='User-ID', how='left')

In [9]:
# books.drop(columns=['Rating Count', 'Average Rating'], inplace=True)

if use:
    books_ratings_count = ratings.groupby('Book Title').size().reset_index(name='Rating Count')

    books_avg_rating = ratings.groupby('Book Title')['Book-Rating'].mean()

    books = pd.merge(books, books_ratings_count, on='Book Title', how='left')
    books = pd.merge(books, books_avg_rating, on='Book Title', how='left')

In [10]:
authors

,Name,Birth Year,Genres,Books
0,Amy Tan,1952.0,"[""Children's book""]","['The Joy Luck Club (novel)', ""The Kitchen God..."
1,John Grisham,1955.0,"['Legal thriller', ' young adult']","['A Time to Kill (Grisham novel)', 'Sycamore R..."
2,Michael Crichton,1942.0,NaN,"['The Andromeda Strain', 'The Terminal Man', '..."
3,Harper Lee,1926.0,['Fiction'],"['To Kill a Mockingbird', 'Go Set a Watchman',..."
4,Barbara Kingsolver,1955.0,Historical fiction,[]
...,...,...,...,...
2116,Li Zhisui,1919.0,NaN,[]
2117,Steve Perry,1949.0,NaN,['The Case of the Curious Bride']
2118,E.L. Konigsburg,1930.0,"Children's novels, short stories, picture books",[]
2119,Louis Guilloux,1899.0,NaN,[]
2120,Martha Ostenso,NaN,"['Historical novel', ' Naturalism']",['Wild Geese (novel)']

In [11]:
# authors.drop(columns=['Rating Count', 'Average Rating'], inplace=True)

if use:
    pass
    # books_ratings_count = authors.groupby('Book Title').size().reset_index(name='Rating Count')

    # books_avg_rating = authors.groupby('Book Title')['Book-Rating'].mean()

    # authors = pd.merge(authors, books_ratings_count, on='Book Title', how='left')
    # authors = pd.merge(authors, books_avg_rating, on='Book Title', how='left')

    # authors.rename(columns={'Name': 'Author'}, inplace=True)
    # avg_ratings_authors = ratings.merge(books, on='Book Title', how='left').merge(authors, on='Author', how='left').groupby('Author')['Book-Rating'].mean()
    # count_ratings_authors = ratings.merge(books, on='Book Title', how='left').merge(authors, on='Author', how='left').groupby('Author')['Book-Rating'].count()

    # avg_ratings_authors.rename('Average Rating', inplace=True)
    # count_ratings_authors.rename('Count Rating', inplace=True)


    # authors.merge(avg_ratings_authors, on='Author', how='left').merge(count_ratings_authors, on='Author', how='left')

In [12]:
# authors.rename(columns={'Genres': 'Author Genres', 'Books': "Author's Books"}, inplace=True)
# books.rename(columns={'Genres': 'Book Genres', 'Author': "Book's Author", 'Average Rating': 'Book Average Rating', 'Rating Count':'Book Rating Count'}, inplace=True)
# users.rename(columns={'Rating Count': 'User Rating Count', 'Average Rating': 'User Average Rating'}, inplace=True)

In [13]:
print("ratings shape: ", ratings.shape)
ratings = ratings.merge(users, on="User-ID")
print("ratings shape: ", ratings.shape)

# Hay libros con tÃ­tulo repetido pero no tienen ratings entonces no deberÃ­a dar error
ratings = ratings.merge(books, on="Book Title")
print("ratings shape: ", ratings.shape)

ratings shape:  (29836, 3)
ratings shape:  (29836, 6)
ratings shape:  (8493, 63)

In [14]:
users

      User-ID                      Location   Age Country
0         243   arden hills, minnesota, usa   NaN     usa
1         254   minneapolis, minnesota, usa  24.0     usa
2         638    san diego, california, usa  20.0     usa
3         805       sonoma, california, usa  34.0     usa
4         882     berkeley, california, usa  23.0     usa
...       ...                           ...   ...     ...
2547   278202   coral springs, florida, usa   NaN     usa
2548   278418          omaha, nebraska, usa   NaN     usa
2549   278582       slidell, louisiana, usa   NaN     usa
2550   278633              sandy, utah, usa   NaN     usa
2551   278843  pismo beach, california, usa  28.0     usa

[2552 rows x 4 columns]

In [15]:
authors.to_csv(output_folder + "authors.csv")
books.to_csv(output_folder + "books.csv")
ratings.to_csv(output_folder + "ratings.csv")
users.to_csv(output_folder + "users.csv")